Feature: Създаване на рецепта

Scenario: Създаване на рецепта
    Given Потребителят се намира на прозореца за създаване на рецепта
    When Потребителят въведе име на лекуващ лекар "Dimitar"
    And Потребителят въведе име на пациента "Baba Stoyana"
    And Потребителят въведе днешна дата "2020-03-08"
    And Потребителят добавя лекарство "лекарство1"
    And Потребителят натиска бутона за създаване на рецепта
    Then Подскача съобщение "Рецептата е създадена успешно"
    
Scenario: Създаване на рецепта без да въведе име на лекуващ лекар	
		Given Потребителят се намира на прозореца за създаване на рецепта
    When Потребителят въведе име на пациента "Baba Stoyana"
    And Потребителят въведе днешна дата "2020-03-08"
    And Потребителят добавя лекарство "лекарство1"
    And Потребителят натиска бутона за създаване на рецепта
    Then Подскача съобщение "Моля, въведете име на лекар"
    
Scenario: Създаване на рецепта без да въведе име на пациент
		Given Потребителят се намира на прозореца за създаване на рецепта
    When Потребителят въведе име на лекуващ лекар "Dimitar"
    And Потребителят въведе днешна дата "2020-03-08"
    And Потребителят добавя лекарство "лекарство1"
    And Потребителят натиска бутона за създаване на рецепта
    Then Подскача съобщение "Моля, въведете име на пациент"
    
Scenario: Създаване на рецепта без да въведе дата
		Given Потребителят се намира на прозореца за създаване на рецепта
    When Потребителят въведе име на лекуващ лекар "Dimitar"
    And Потребителят въведе име на пациента "Baba Stoyana"
    And Потребителят добавя лекарство "лекарство1"
    And Потребителят натиска бутона за създаване на рецепта
    Then Подскача съобщение "Моля, въведете дата"
    
  Scenario: Създаване на рецепта без да въведе лекарство
		Given Потребителят се намира на прозореца за създаване на рецепта
    When Потребителят въведе име на лекуващ лекар "Dimitar"
    And Потребителят въведе име на пациента "Baba Stoyana"
    And Потребителят въведе днешна дата "2020-03-08"
    And Потребителят натиска бутона за създаване на рецепта
    Then Подскача съобщение "Моля, въведете лекарство"
    